app/controllers/home_controller.rb

INSERT INTO "posts" ("title", "contents", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdasd"], ["contents", "asdasd"], ["created_at", "2017-05-04 09:50:43.976418"], ["updated_at", "2017-05-04 09:50:43.976418"]]
---
  def create

    lion = Post.new
    lion.title = params[:title]
    lion.contents = params[:contents]

    lion.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
---
  def show

    # @post = Post.find(params["id"])  아래꺼랑 똑같은거임.
    @post = Post.where(id: params["id"]).first

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit

    @post = Post.where(id: params["id"]).first

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["id", nil]]
UPDATE "posts" SET "contents" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["contents", "qweqwe"], ["updated_at", "2017-05-04 11:08:37.961381"], ["id", 2]]
---
  def update

    hehe = Post.where(id: params[:id]).first
    hehe.title = params[:title]
    hehe.contents = params[:contents]
    hehe.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy

    hehe = Post.where(id: params[:id]).first
    hehe.destroy